'use strict';

// Создает Моки
// ... data.js


// Отрисовка сгенерированных DOM-элементов в блок .map__pins
// ... pin.js

// Функция активации формы объявления
// ... form.js

// Функция активации формы фильтра
// ... form.js

// Дезактивация карты
// ... map.js

// Дезактивация формы заполнения информации об объявлении .ad-form
// ... form.js

// Дезактивация формы с фильтрами .map__filters
// ... form.js

// Активация форм
// ... form.js

// Вносит коорднаты метки в поле адреса
// ... pin.js

// Возвращает координаты острого конца метки
// ... pin.js

// Перемещение метки
// ... map.js

// Обработчик опций выбора места
// ... form.js

// Обработчик время заезда + синхронизация полей option
// ... form.js

// Переключатель места проживания
// ... form.js

// Переключатель времени заезда
// ... form.js

// Переключатель времени выезда
// ... form.js
